// 1․-------------------------------------------------------------------
let a = 85;
let b = 55;
let c = 165;

if(a<b){
    console.log("1")
}
else if(c<a){
    console.log("2")
}
else{
    console.log("3")
};

// Էս նույն կոդը գրել մի տողով, օգատործելով || և && օպերատորները

// -----------------------------------------------------------------------

// 2․--------------------------------------------------------------------------
const obj = {
    name : "Levon"
};

setTimeout(()=>{
    console.log(this)
},2000);

// Էս կոդի կտորը ցանկացած հնարավոր ձևով պահելով, ինչ ուզում ես ավելացրու, նենց արա որ this-ը լինի վերևի object-ը

// 3---------------------------------------------------------------------------

// setInterval-ով ստանալ setTimeout և հակառակը

// 4-----------------------------------------------------------------------------

const array = ["Levon", "Ararat", 15, 16, true, false];

const newArray =  array.getArrayByElementTypes("number");

// Գրել Ֆունկցիա որը կանչելով հետևյալ կերպ կվերադարձնի նոր array որը կունենա element-ներ նշված type-ով
