// 1․-------------------------------------------------------------------
// ToDo: Էս նույն կոդը գրել մի տողով, օգատործելով || և && օպերատորները։
// ToDo: Էս նույն կոդը գրել մի տողով, օգատործելով Ternary օպերատորը։
let a = 85;
let b = 55;
let c = 165;

if(a<b){
    console.log("1")
}
else if(c<a){
    console.log("2")
}
else{
    console.log("3")
};

// 2.----------------------------------------------------------------------
//ToDo:  Տպել 1-25 թվերը հերթականությամբ, սակայն Թվերը որոնք բաժանվում են 5-ի կամ 3-ի դրանց փոխարեն տպել`
// համապատասխանաբար "Five" ու "Three": Եթե թիվը բաժանվում է միաժամանակ 5-ի ու 3-ի, տպել "Five and Three"!

//Result:
// 1,2,"Three",4,"Five","Three",7,8,"Three","Five",11,"Three",13,14,"Five and Three",
// 16,17,"Three",19,"Five","Three",22,23,"Three","Five"

// 3․--------------------------------------------------------------------------
// ToDo: Էս կոդի կտորը ցանկացած հնարավոր ձևով պահելով, ինչ ուզում ես ավելացրու,
//  նենց արա որ this-ը լինի վերևի object-ը

const obj = {
    name : "Jason"
};

setTimeout(()=>{
     console.log(this)
},2000);



// 4․---------------------------------------------------------------------------
// ToDo: setInterval-ով ստանալ setTimeout և հակառակը
// ToDo: Promise-ով ստանալ setTimeout


// 5․-----------------------------------------------------------------------------
// ToDo: Գրել Ֆունկցիա որը կանչելով հետևյալ կերպ կվերադարձնի նոր array որը կունենա element-ներ նշված type-ով

const arr = ["Levon", "Ararat", 15, 16, true, false];
arr.getArrayByElementTypes("boolean");

//Result
//[true, false]

// 6․-----------------------------------------------------------------------------
// ToDo: Գրել Ֆունկցիա որը կանչելով հետևյալ կերպ կվերադարձնի նոր array որը կունենա ներքևում նշված տեսքը։

const arr1 = ["HH","BB","KK","OO","LL"];
arr1.insertArrayByStep(["Levon","Ararat"],2);

//Result
// ["HH","BB","Levon","KK","OO","Ararat","LL"];


// 7․-----------------------------------------------------------------------------
// ToDo: Գրել Ֆունկցիա որը կանչելով հետևյալ կերպ կվերադարձնի object որը կունենա ներքևում նշված տեսքը։

const arr2 = ["Ararat", "Levon", 25, true, false];
arr2.getObjectWithKeys(["name0","name1",null,"name2"]);

// Result
// {
//     name0 : "Ararat",
//     name1 : "Levon",
//     name2 : true
// }


//////////////////////////////>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

// 8․-----------------------------------------------------------------------------
// ToDo: Տվյալ կոդը run անելուց հետո մտնում ա catch-ի մեջ։
//  Նշված կոդը նենց անել(օգտագործել մենակ var) որ տպի հետևյալը(1 վայրկյանը մեկը)>
// START_VALUE
// 0
// 1
// 2
// 3
// 4
// this is data 4

const obj = {
    value: "Hello",
    changevalue(value) {
        this.value = value;
        return this.value
    }
};

let x = 5;

const testPromise = new Promise((res, rej) => {
    res(this.changevalue(x))
}).then((data) => {
    // Պիտի տպի x թիվը
    console.log("START_VALUE",data);
    return data
}).catch((data) => {
    console.log(data, "CANT CONTINUE");
}).then((data) => {
    // Պիտի 1 վայրկյանը մեկ տպի 0-ից մինչև x-1 թիվը
}).then((data) => {
    // Data-ն պետք է լինի x-1 թիվը
    console.log("this is data", data)
});


// 9․-----------------------------------------------------------------------------
// ToDo: Գրել async ֆունկցիա, որը 5 վայրկյան հետո կտպի Hello:

//callTimer(5000,()=>{console.log("Hello")});

// 10․-----------------------------------------------------------------------------
// ToDo: a փոխականի var-ը չփոխելով նենց անել որ տպի 0-ից 5 ։

for(var a = 0; a <= 5; a++){
    setTimeout(()=>{
        console.log(a)
    })
}
// ------------------------------------------->
